/********************************************************************

　標準データの定義


  ********************************************************************/
#ifndef _DATA_H
#define _DATA_H

#ifdef __cplusplus
extern "C" {
#endif

#include "basicdef.h"
/************************************************************************

☆外部公開変数

  ***********************************************************************/
extern const u16 PlttData_Sample[16][16];
extern const u32 CharData_Sample[8*0x100];

#ifdef __cplusplus
}
#endif

#endif /* _DATA_H */
